learn/js/js.org
#+TITLE: Javscript Notes
#+OPTIONS: toc:2
#+STYLE: <style>pre.src { width: 80%; margin: 0 auto; }</style>
* Basics

** Data types
*** Basic data types
   - number
   - string
   - boolean
   - null
   - undefined
*** Everything else is an object
    - null is an object too!
    - functions are objects, but of type function
      #+BEGIN_SRC javascript
      var x = function (){};
      typeof x; // "function"
      #+END_SRC

** prototype
   - functions have a prototype object
   - regular objects has a secret to the prototype object of their constructor function. The links is established when the contructor function is called with new.
   - Object literals are linked to Object.prototype, functions are linked to Function.prototype, which is linked to Object.prototype

* Functions
** Invocation patterns
   In addition to the regular arguments, a function also receives two extra, implied arguments: /this/ and /arguments/
   How a function is invoked determines what =this= means.

*** Method Invocation Pattern
    - When a function is stored as a property in an object, it's called a /method/.
    - When a function is invoked by refinement ( . notation or [subscript] ), it's invoked as a method.
    - When a function invoked as a method, /this/ is bound to the object, binding happens at invocation time.
    - Methods that get their object context from /this/ are called /public methods/.
*** Function Invocation Pattern
    - Directly invoked, /this/ is bound to the /global object/.
    - Problem: inner function won't have access to /this/ of outer function. Solution: define a variable (/that/ by convention) and assign /this/ to it in outer  function. Inner function have access to /that/.
      #+BEGIN_SRC javascript
      myObject.double = function ( ){
          var that = this;  // workaround
          var helper = function ( ){
              that.value = add( that.value, that.value );
          };
          helper( );  // function invocation
      };
      #+END_SRC
*** Constructor Invocation Pattern
    - When invoked with the =new= operator, a function returns an object that has the secret link to the function's prototype object.
    - /this/ is bound to the new object.
    - Add methods to the function's prototype object will give public methods to created objects.
*** Apply Invocation Pattern
    - /apply/ can change function invocation context.
    - /apply/ received two arguments: the first value will be bound to /this/ in the function, the second is an array containing parameters.


* Object Creation
** Factory Pattern

#+BEGIN_SRC javascript
var someone = createPerson(name, age){
    var person = {
        name: name,
        age : age,
        sayHi : function(){
            alert(this.name + " says Hi!");
        }
    };
    return person;
}
#+END_SRC

  * Pros:
    - Can create many similar objects
  * Cons:
    - No type identification.
    - Methods are duplicate for each instance

** Constructor Pattern

#+BEGIN_SRC javascript
function Person(name, age){
    this.name = name;
    this.age  = age;
    this.sayHi = function(){
            alert(this.name + " says Hi!");
        }
    };
};

var someone = new Person('Jack', 20);

#+END_SRC

  * No explicit object creation or return.
  * Properties and methods are assigened to =this=.
  * Function name capitalized to indicate it's a constructor.
  * Instances have a =constructor= property that points back to consturctor function.
  * Pros
    - =instanceof= operator works => correct type identification.
  * Cons
    - Methods are still duplicated for each instance.

** Prototype Pattern

