learn/js/js.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Javscript Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Javscript Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-18T17:52-0400"/>
<meta name="author" content="Xiaohui Lu"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Javscript Notes</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Basics</a>
<ul>
<li><a href="#sec-1-1">1.1 Data types</a></li>
<li><a href="#sec-1-2">1.2 prototype</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Functions</a>
<ul>
<li><a href="#sec-2-1">2.1 Invocation patterns</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Object Creation</a>
<ul>
<li><a href="#sec-3-1">3.1 Factory Pattern</a></li>
<li><a href="#sec-3-2">3.2 Constructor Pattern</a></li>
<li><a href="#sec-3-3">3.3 Prototype Pattern</a></li>
<li><a href="#sec-3-4">3.4 Parasitic Constructor Pattern</a></li>
<li><a href="#sec-3-5">3.5 Durable Constructor Pattern</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Inheritance</a>
<ul>
<li><a href="#sec-4-1">4.1 Prototype chaining</a></li>
<li><a href="#sec-4-2">4.2 Constructor stealing</a></li>
<li><a href="#sec-4-3">4.3 Combination Inheritance a.k.a. Pseudoclassical Inheritance</a></li>
<li><a href="#sec-4-4">4.4 Prototypal Inheritance</a></li>
<li><a href="#sec-4-5">4.5 Parasitic Inheritance</a></li>
<li><a href="#sec-4-6">4.6 Parasitic Combination Inheritance</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Basics</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Data types</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Basic data types</h4>
<div class="outline-text-4" id="text-1-1-1">

<ul>
<li>number
</li>
<li>string
</li>
<li>boolean
</li>
<li>null
</li>
<li>undefined
</li>
</ul>

</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Everything else is an object</h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li>null is an object too!
</li>
<li>functions are objects, but of type function



<pre class="src src-javascript"><span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">x</span> = <span style="color: #8ac6f2;">function</span> (){};
<span style="color: #8ac6f2;">typeof</span> x; <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">"function"</span>
</pre>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> prototype</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>functions have a prototype object
</li>
<li>regular objects has a secret to the prototype object of their constructor function. The links is established when the contructor function is called with new.
</li>
<li>Object literals are linked to Object.prototype, functions are linked to Function.prototype, which is linked to Object.prototype
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Functions</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Invocation patterns</h3>
<div class="outline-text-3" id="text-2-1">

<p>   In addition to the regular arguments, a function also receives two extra, implied arguments: <i>this</i> and <i>arguments</i>
   How a function is invoked determines what <code>this</code> means.
</p>

</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Method Invocation Pattern</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li>When a function is stored as a property in an object, it's called a <i>method</i>.
</li>
<li>When a function is invoked by refinement ( . notation or [subscript] ), it's invoked as a method.
</li>
<li>When a function invoked as a method, <i>this</i> is bound to the object, binding happens at invocation time.
</li>
<li>Methods that get their object context from <i>this</i> are called <i>public methods</i>.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Function Invocation Pattern</h4>
<div class="outline-text-4" id="text-2-1-2">

<ul>
<li>Directly invoked, <i>this</i> is bound to the <i>global object</i>.
</li>
<li>Problem: inner function won't have access to <i>this</i> of outer function. Solution: define a variable (<i>that</i> by convention) and assign <i>this</i> to it in outer  function. Inner function have access to <i>that</i>.



<pre class="src src-javascript">myObject.<span style="color: #cae682;">double</span> = <span style="color: #8ac6f2;">function</span> ( ){
    <span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">that</span> = <span style="color: #e5786d;">this</span>;  <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">workaround</span>
    <span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">helper</span> = <span style="color: #8ac6f2;">function</span> ( ){
        that.value = add( that.value, that.value );
    };
    helper( );  <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">function invocation</span>
};
</pre>

</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Constructor Invocation Pattern</h4>
<div class="outline-text-4" id="text-2-1-3">

<ul>
<li>When invoked with the <code>new</code> operator, a function returns an object that has the secret link to the function's prototype object.
</li>
<li><i>this</i> is bound to the new object.
</li>
<li>Add methods to the function's prototype object will give public methods to created objects.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Apply Invocation Pattern</h4>
<div class="outline-text-4" id="text-2-1-4">

<ul>
<li><i>apply</i> can change function invocation context.
</li>
<li><i>apply</i> received two arguments: the first value will be bound to <i>this</i> in the function, the second is an array containing parameters.
</li>
</ul>



</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Object Creation</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Factory Pattern</h3>
<div class="outline-text-3" id="text-3-1">





<pre class="src src-javascript"><span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">someone</span> = createPerson(name, age){
    <span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">person</span> = {
        name: name,
        age : age,
        <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">sayHi</span> : <span style="color: #8ac6f2;">function</span>(){
            alert(<span style="color: #e5786d;">this</span>.name + <span style="color: #95e454; font-style: italic;">" says Hi!"</span>);
        }
    };
    <span style="color: #8ac6f2;">return</span> person;
}
</pre>


<ul>
<li>Pros:
<ul>
<li>Can create many similar objects
</li>
</ul>

</li>
<li>Cons:
<ul>
<li>No type identification.
</li>
<li>Methods are duplicate for each instance
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Constructor Pattern</h3>
<div class="outline-text-3" id="text-3-2">





<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">Person</span>(<span style="color: #8ac6f2;">name</span>, <span style="color: #8ac6f2;">age</span>){
    <span style="color: #e5786d;">this</span>.name = name;
    <span style="color: #e5786d;">this</span>.age  = age;
    <span style="color: #e5786d;">this</span>.sayHi = <span style="color: #8ac6f2;">function</span>(){
            alert(<span style="color: #e5786d;">this</span>.name + <span style="color: #95e454; font-style: italic;">" says Hi!"</span>);
        }
    };
};

<span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">someone</span> = <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">Person</span>(<span style="color: #95e454; font-style: italic;">'Jack'</span>, 20);

</pre>


<ul>
<li>No explicit object creation or return.
</li>
<li>Properties and methods are assigened to <code>this</code>.
</li>
<li>Function name capitalized to indicate it's a constructor.
</li>
<li>Instances have a <code>constructor</code> property that points back to consturctor function.
</li>
<li>Pros
<ul>
<li><code>instanceof</code> operator works =&gt; correct type identification.
</li>
</ul>

</li>
<li>Cons
<ul>
<li>Methods are still duplicated for each instance.
</li>
</ul>

</li>
</ul>


</div>

</div>
