learn/js/js.org
*** Pure Prototype Pattern

#+BEGIN_SRC javascript
function Person(){}
Person.prototype.name = "Jack";
Person.prototype.age  = 27;
Person.Prorotype.sayHi = function(){ alert(this.name + " says Hi!"); };

var someone = new Person();
#+END_SRC

Alternative prototype specification:
#+BEGIN_SRC javascript
function Person(){}

Person.prorotype = {
    constructor : Person, /* Default prototype has this property.
                           * If not set here, Person.prototype will not have correct constructor prop.
                           * Main difference between this and above code.
                           * constructor defined this way is enumerable, default is not, see code below.
                           */
    name : 'Jack',
    age  : 27,
    sayHi : function(){ alert(this.name + " says Hi!"); }
}
#+END_SRC

Prototype specification with not enumerable constructor property:
#+BEGIN_SRC javascript
function Person(){}
Person.prototype = {
    name : 'Jack',
    age  : 27,
    sayHi : function (){alert(this.name + " says Hi!");}
}

//ECMAScript 5 only! - restore the constructor
Object.defineProperty(Person.prototype, "constructor", {
    enumerable : false,
    value: Person
});
#+END_SRC

  * Most important feature of Javascript.
  * Instances will share properties in prototype unless overwritten by instance properties.
  * Constructor function has to be called with =new= operator.
  * Instances created this way has internal _[ [prototype ] ]_ property referring to constructor's =prototype= object.
  * =isPrototypeOf()= can be used to determin if an prorotype object is the prorotype of an instance.
  * =Object.getProrotypeOf(obj)= can be used to get prototype of =obj=.
  * =in= operator can be used to determine if a property can be accessed on an object, whether it's an instance property or prototype property.
  * Instance method =hasOwnProperty()= can be used to filter instance properties from prototype properties.
  * =Object.keys()= can be used to get all *enumerable*, *instance* properties of an object.
  * Pros:
    - Efficient properties/methods sharing.
    - Easy to have instance properties/methods, just overwrite.
  * Cons:
    - Reference types of properties may be shared in undesired ways.
    - Pure Prototype Pattern won't be able to customize instances by passing arguments.

*** Combination Constructor/Prototype Pattern

#+BEGIN_SRC javascript
function Person(name, age){
    this.name = name;
    this.age  = age;
}

Person.prototype.sayHi = function(){ alert(this.name + " says Hi!"); }

var someone = new Person('Jack', 27);
#+END_SRC

  * Instance properties are defined solely in constructor.
  * Shared properties/methods are defined in constructor's prototype.
  * Default pattern to use for defining reference types.

*** Dynamic Prototype Pattern

#+BEGIN_SRC javascript
function Person(name, age){
    this.name = name;
    this.age  = age;
    if ( typeof this.sayHi !== 'function'){  // only executes on first time
        Person.prototype.sayHi() = function(){alert(this.name + " says Hi!"); }
    }
}
#+END_SRC

** Parasitic Constructor Pattern

#+BEGIN_SRC javascript
function Person(name, age){
    var o = new Object();
    o.name = name;
    o.age = age;
    o.sayHi = function(){alert(this.name + " says Hi!");}

    return o;
}
#+END_SRC

  * Create a constructor that simply wraps creation and return another object.
  * Factory Pattern that looks like Constructor Pattern.
  * Uses =new= in function call but doesn't create link between object and constructor's prototype.
  * Uses =return= to explicitly return object.

** Durable Constructor Pattern

#+BEGIN_SRC javascript
function Person(name, age){
    var o = new Object();
    // optionally define private properties/methods here

    // attach methods
    o.sayHi = function(){ alert(name + " says Hi!") }; // NOT 'this.name'!!!
    o.getAge = function(){ return age; }
    // return object  
    return o;
}

var someone = Person('Jack', 27);
someone.sayHi(); // Jack says Hi!
#+END_SRC

  * Looks like Factory pattern but quite different.
  * No way to access =name=, =age= directly from returned instance object.
  * Constructor is *not* called with =new=.
  * Useful when dealing with secure execution environments.

* Inheritance

