learn/js/js.html

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Prototype Pattern</h3>
<div class="outline-text-3" id="text-3-3">



</div>

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Pure Prototype Pattern</h4>
<div class="outline-text-4" id="text-3-3-1">





<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">Person</span>(){}
Person.<span style="color: #e5786d;">prototype</span>.name = <span style="color: #95e454; font-style: italic;">"Jack"</span>;
Person.<span style="color: #e5786d;">prototype</span>.age  = 27;
Person.Prorotype.sayHi = <span style="color: #8ac6f2;">function</span>(){ alert(<span style="color: #e5786d;">this</span>.name + <span style="color: #95e454; font-style: italic;">" says Hi!"</span>); };

<span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">someone</span> = <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">Person</span>();
</pre>


<p>
Alternative prototype specification:
</p>


<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">Person</span>(){}

Person.prorotype = {
    constructor : Person, <span style="color: #99968b; font-style: italic;">/* </span><span style="color: #99968b; font-style: italic;">Default prototype has this property.</span>
<span style="color: #99968b; font-style: italic;">                           * If not set here, Person.prototype will not have correct constructor prop.</span>
<span style="color: #99968b; font-style: italic;">                           * Main difference between this and above code.</span>
<span style="color: #99968b; font-style: italic;">                           * constructor defined this way is enumerable, default is not, see code below.</span>
<span style="color: #99968b; font-style: italic;">                           */</span>
    name : <span style="color: #95e454; font-style: italic;">'Jack'</span>,
    age  : 27,
    <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">sayHi</span> : <span style="color: #8ac6f2;">function</span>(){ alert(<span style="color: #e5786d;">this</span>.name + <span style="color: #95e454; font-style: italic;">" says Hi!"</span>); }
}
</pre>


<p>
Prototype specification with not enumerable constructor property:
</p>


<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">Person</span>(){}
<span style="color: #cae682;">Person</span>.<span style="color: #e5786d;">prototype</span> = {
    name : <span style="color: #95e454; font-style: italic;">'Jack'</span>,
    age  : 27,
    <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">sayHi</span> : <span style="color: #8ac6f2;">function</span> (){alert(<span style="color: #e5786d;">this</span>.name + <span style="color: #95e454; font-style: italic;">" says Hi!"</span>);}
}

<span style="color: #99968b; font-style: italic;">//</span><span style="color: #99968b; font-style: italic;">ECMAScript 5 only! - restore the constructor</span>
Object.defineProperty(Person.<span style="color: #e5786d;">prototype</span>, <span style="color: #95e454; font-style: italic;">"constructor"</span>, {
    enumerable : <span style="color: #e5786d;">false</span>,
    value: Person
});
</pre>


<ul>
<li>Most important feature of Javascript.
</li>
<li>Instances will share properties in prototype unless overwritten by instance properties.
</li>
<li>Constructor function has to be called with <code>new</code> operator.
</li>
<li>Instances created this way has internal <span style="text-decoration:underline;">[ [prototype ] ]</span> property referring to constructor's <code>prototype</code> object.
</li>
<li><code>isPrototypeOf()</code> can be used to determin if an prorotype object is the prorotype of an instance.
</li>
<li><code>Object.getProrotypeOf(obj)</code> can be used to get prototype of <code>obj</code>.
</li>
<li><code>in</code> operator can be used to determine if a property can be accessed on an object, whether it's an instance property or prototype property.
</li>
<li>Instance method <code>hasOwnProperty()</code> can be used to filter instance properties from prototype properties.
</li>
<li><code>Object.keys()</code> can be used to get all <b>enumerable</b>, <b>instance</b> properties of an object.
</li>
<li>Pros:
<ul>
<li>Efficient properties/methods sharing.
</li>
<li>Easy to have instance properties/methods, just overwrite.
</li>
</ul>

</li>
<li>Cons:
<ul>
<li>Reference types of properties may be shared in undesired ways.
</li>
<li>Pure Prototype Pattern won't be able to customize instances by passing arguments.
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Combination Constructor/Prototype Pattern</h4>
<div class="outline-text-4" id="text-3-3-2">





<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">Person</span>(<span style="color: #8ac6f2;">name</span>, <span style="color: #8ac6f2;">age</span>){
    <span style="color: #e5786d;">this</span>.name = name;
    <span style="color: #e5786d;">this</span>.age  = age;
}

Person.<span style="color: #e5786d;">prototype</span>.sayHi = <span style="color: #8ac6f2;">function</span>(){ alert(<span style="color: #e5786d;">this</span>.name + <span style="color: #95e454; font-style: italic;">" says Hi!"</span>); }

<span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">someone</span> = <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">Person</span>(<span style="color: #95e454; font-style: italic;">'Jack'</span>, 27);
</pre>


<ul>
<li>Instance properties are defined solely in constructor.
</li>
<li>Shared properties/methods are defined in constructor's prototype.
</li>
<li>Default pattern to use for defining reference types.
</li>
</ul>


</div>

</div>

<div id="outline-container-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> Dynamic Prototype Pattern</h4>
<div class="outline-text-4" id="text-3-3-3">





<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">Person</span>(<span style="color: #8ac6f2;">name</span>, <span style="color: #8ac6f2;">age</span>){
    <span style="color: #e5786d;">this</span>.name = name;
    <span style="color: #e5786d;">this</span>.age  = age;
    <span style="color: #8ac6f2;">if</span> ( <span style="color: #8ac6f2;">typeof</span> <span style="color: #e5786d;">this</span>.sayHi !== <span style="color: #95e454; font-style: italic;">'function'</span>){  <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">only executes on first time</span>
        Person.<span style="color: #e5786d;">prototype</span>.sayHi() = <span style="color: #8ac6f2;">function</span>(){alert(<span style="color: #e5786d;">this</span>.name + <span style="color: #95e454; font-style: italic;">" says Hi!"</span>); }
    }
}
</pre>


</div>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Parasitic Constructor Pattern</h3>
<div class="outline-text-3" id="text-3-4">





<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">Person</span>(<span style="color: #8ac6f2;">name</span>, <span style="color: #8ac6f2;">age</span>){
    <span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">o</span> = <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">Object</span>();
    o.name = name;
    o.age = age;
    o.sayHi = <span style="color: #8ac6f2;">function</span>(){alert(<span style="color: #e5786d;">this</span>.name + <span style="color: #95e454; font-style: italic;">" says Hi!"</span>);}

    <span style="color: #8ac6f2;">return</span> o;
}
</pre>


<ul>
<li>Create a constructor that simply wraps creation and return another object.
</li>
<li>Factory Pattern that looks like Constructor Pattern.
</li>
<li>Uses <code>new</code> in function call but doesn't create link between object and constructor's prototype.
</li>
<li>Uses <code>return</code> to explicitly return object.
</li>
</ul>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Durable Constructor Pattern</h3>
<div class="outline-text-3" id="text-3-5">





<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">Person</span>(<span style="color: #8ac6f2;">name</span>, <span style="color: #8ac6f2;">age</span>){
    <span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">o</span> = <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">Object</span>();
    <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">optionally define private properties/methods here</span>

    <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">attach methods</span>
    o.sayHi = <span style="color: #8ac6f2;">function</span>(){ alert(name + <span style="color: #95e454; font-style: italic;">" says Hi!"</span>) }; <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">NOT 'this.name'!!!</span>
    o.getAge = <span style="color: #8ac6f2;">function</span>(){ <span style="color: #8ac6f2;">return</span> age; }
    <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">return object  </span>
    <span style="color: #8ac6f2;">return</span> o;
}

<span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">someone</span> = Person(<span style="color: #95e454; font-style: italic;">'Jack'</span>, 27);
someone.sayHi(); <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">Jack says Hi!</span>
</pre>


<ul>
<li>Looks like Factory pattern but quite different.
</li>
<li>No way to access <code>name</code>, <code>age</code> directly from returned instance object.
</li>
<li>Constructor is <b>not</b> called with <code>new</code>.
</li>
<li>Useful when dealing with secure execution environments.
</li>
</ul>


</div>
</div>

</div>
