learn/js/js.org
** Prototype chaining

#+BEGIN_SRC javascript
function SuperType(){
    this.superProperty = true;
}
SuperType.prototype.getSuperProperty = function(){ return this.superProperty; }

function SubType(){
    this.subProperty = false;
}
SubType.prototype.getSubProperty = function(){ return this.subProperty; }

var obj = new SubType();
obj.getSuperProperty(); // true
obj.getSubProperty();   // false
#+END_SRC

 * =SubType.prototype= is an SuperType instance which has its [ [prototype] ] linked to =SuperType.prototype=.
 * SubType instances have their [ [prototype ] ] linked to =SubType.prototype= which is linked to =SuperType.prototype=.
 * SubType instances have access to all properties/methods defined in =Subtype.prototype= *and* =SuperType.prototype=.
 * All reference types inherit from =Object.prototype=
 * Cons:
   - Undesired shared reference properties can happen.
   - No way to pass arguments to supertype constructor.

** Constructor stealing
#+BEGIN_SRC javascript
function SuperType(name){
    this.name = name;
}

function SubType(name, age){
    SuperType.call(name);
    this.age = age;
}

var obj = new SubType('Jack', 27);
obj.name; // Jack
obj.age;  // 27
#+END_SRC

  * Call the supertype constructor from within the subtype constructor.
  * Use =call()= or =apply()= to change execution context to newly created object.
  * Arguments can be passed too.
  * Cons:
    - Pure constructor stealing cannot share methods in supertype's prototype.

** Combination Inheritance a.k.a. Pseudoclassical Inheritance
#+BEGIN_SRC javascript
function SuperType(name){
    this.name = name;
}
// define SuperType methods
SuperType.prototype.sayName = function(){alert("My name is " + this.name);};

function SubType(name, age){
    SuperType.call(this, name);
    this.age = age;
}
// inherit from SuperType
SubType.prototype = new SuperType();
// Define more methods for SubType
SubType.prototype.sayAge = function(){alert("I'm " + this.age + " years old.");};

var obj = new SubType('Jack', 27);
obj.sayName(); // My name is Jack
obj.sayAge();  // I'm 27 years old.
#+END_SRC

  * Most frequently used inheritance pattern.
  * Preserves behavior of =instanceof= and =isPrototypeOf()=
  * Cons:
    - Supertype constructor called twice: once to create prototype for subtype, and again called in subtype's constructor.
    - Properties defined in subtype's prototype (instance of supertype) are masked by instance properties defined in constructor calls.

** Prototypal Inheritance
#+BEGIN_SRC javascript
function beget(o){
    function F(){};
    F.prototype = o;
    return new F();
}

var me = {
    name: "Jack",
    sayHi: function(){alert(this.name + " says Hi");}
};

var other = beget(me);
other.sayHi(); // 'Jack says Hi!'
other.name = 'Joe';
other.sayHi(); // 'Joe says Hi!'
#+END_SRC

  * Direct object inheritance: inherit properties/methods from another object.
  * Implemented as ECMAScript 5's =Object.create()=.
  * Useful when there's no need for overhead of creating separate constructors but need an object to behave similarly to another.

** Parasitic Inheritance

#+BEGIN_SRC javascript
function createAnother(original){
    var another = Object.create(original);
    another.doSomething = function(){ alert("does something");};

    return another;
}
#+END_SRC

  * Use Prototype Inheritance to create similar objects from existin object.
  * Add new methods/properties.
  * No code reuse.

** Parasitic Combination Inheritance

#+BEGIN_SRC javascript
function inheritPrototype(subtype, supertype){
    var proto = Object.create(supertype.prototype);
    proto.constructor = subtype;
    subtype.prototype = proto;
}

inheritPrototype(SubType, SuperType); // replace SubType.prototype = new SuperType();
#+END_SRC

  * Considered the most optimal inheritance paradigm.
  * Supertype's constructor called only once.
  * No duplicate properties in instance and prototype.
  * Prototype chain is kept intact.
