learn/js/js.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Inheritance</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Prototype chaining</h3>
<div class="outline-text-3" id="text-4-1">





<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">SuperType</span>(){
    <span style="color: #e5786d;">this</span>.superProperty = <span style="color: #e5786d;">true</span>;
}
SuperType.<span style="color: #e5786d;">prototype</span>.getSuperProperty = <span style="color: #8ac6f2;">function</span>(){ <span style="color: #8ac6f2;">return</span> <span style="color: #e5786d;">this</span>.superProperty; }

<span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">SubType</span>(){
    <span style="color: #e5786d;">this</span>.subProperty = <span style="color: #e5786d;">false</span>;
}
SubType.<span style="color: #e5786d;">prototype</span>.getSubProperty = <span style="color: #8ac6f2;">function</span>(){ <span style="color: #8ac6f2;">return</span> <span style="color: #e5786d;">this</span>.subProperty; }

<span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">obj</span> = <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">SubType</span>();
obj.getSuperProperty(); <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">true</span>
obj.getSubProperty();   <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">false</span>
</pre>


<ul>
<li><code>SubType.prototype</code> is an SuperType instance which has its [ [prototype] ] linked to <code>SuperType.prototype</code>.
</li>
<li>SubType instances have their [ [prototype ] ] linked to <code>SubType.prototype</code> which is linked to <code>SuperType.prototype</code>.
</li>
<li>SubType instances have access to all properties/methods defined in <code>Subtype.prototype</code> <b>and</b> <code>SuperType.prototype</code>.
</li>
<li>All reference types inherit from <code>Object.prototype</code>
</li>
<li>Cons:
<ul>
<li>Undesired shared reference properties can happen.
</li>
<li>No way to pass arguments to supertype constructor.
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Constructor stealing</h3>
<div class="outline-text-3" id="text-4-2">




<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">SuperType</span>(<span style="color: #8ac6f2;">name</span>){
    <span style="color: #e5786d;">this</span>.name = name;
}

<span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">SubType</span>(<span style="color: #8ac6f2;">name</span>, <span style="color: #8ac6f2;">age</span>){
    SuperType.call(name);
    <span style="color: #e5786d;">this</span>.age = age;
}

<span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">obj</span> = <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">SubType</span>(<span style="color: #95e454; font-style: italic;">'Jack'</span>, 27);
obj.name; <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">Jack</span>
obj.age;  <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">27</span>
</pre>


<ul>
<li>Call the supertype constructor from within the subtype constructor.
</li>
<li>Use <code>call()</code> or <code>apply()</code> to change execution context to newly created object.
</li>
<li>Arguments can be passed too.
</li>
<li>Cons:
<ul>
<li>Pure constructor stealing cannot share methods in supertype's prototype.
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Combination Inheritance a.k.a. Pseudoclassical Inheritance</h3>
<div class="outline-text-3" id="text-4-3">




<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">SuperType</span>(<span style="color: #8ac6f2;">name</span>){
    <span style="color: #e5786d;">this</span>.name = name;
}
<span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">define SuperType methods</span>
SuperType.<span style="color: #e5786d;">prototype</span>.sayName = <span style="color: #8ac6f2;">function</span>(){alert(<span style="color: #95e454; font-style: italic;">"My name is "</span> + <span style="color: #e5786d;">this</span>.name);};

<span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">SubType</span>(<span style="color: #8ac6f2;">name</span>, <span style="color: #8ac6f2;">age</span>){
    SuperType.call(<span style="color: #e5786d;">this</span>, name);
    <span style="color: #e5786d;">this</span>.age = age;
}
<span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">inherit from SuperType</span>
SubType.<span style="color: #e5786d;">prototype</span> = <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">SuperType</span>();
<span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">Define more methods for SubType</span>
SubType.<span style="color: #e5786d;">prototype</span>.sayAge = <span style="color: #8ac6f2;">function</span>(){alert(<span style="color: #95e454; font-style: italic;">"I'm "</span> + <span style="color: #e5786d;">this</span>.age + <span style="color: #95e454; font-style: italic;">" years old."</span>);};

<span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">obj</span> = <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">SubType</span>(<span style="color: #95e454; font-style: italic;">'Jack'</span>, 27);
obj.sayName(); <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">My name is Jack</span>
obj.sayAge();  <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">I'm 27 years old.</span>
</pre>


<ul>
<li>Most frequently used inheritance pattern.
</li>
<li>Preserves behavior of <code>instanceof</code> and <code>isPrototypeOf()</code>
</li>
<li>Cons:
<ul>
<li>Supertype constructor called twice: once to create prototype for subtype, and again called in subtype's constructor.
</li>
<li>Properties defined in subtype's prototype (instance of supertype) are masked by instance properties defined in constructor calls.
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Prototypal Inheritance</h3>
<div class="outline-text-3" id="text-4-4">




<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">beget</span>(<span style="color: #8ac6f2;">o</span>){
    <span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">F</span>(){};
    F.<span style="color: #e5786d;">prototype</span> = o;
    <span style="color: #8ac6f2;">return</span> <span style="color: #8ac6f2;">new</span> <span style="color: #cae682;">F</span>();
}

<span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">me</span> = {
    name: <span style="color: #95e454; font-style: italic;">"Jack"</span>,
    <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">sayHi</span>: <span style="color: #8ac6f2;">function</span>(){alert(<span style="color: #e5786d;">this</span>.name + <span style="color: #95e454; font-style: italic;">" says Hi"</span>);}
};

<span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">other</span> = beget(me);
other.sayHi(); <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">'Jack says Hi!'</span>
other.name = <span style="color: #95e454; font-style: italic;">'Joe'</span>;
other.sayHi(); <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">'Joe says Hi!'</span>
</pre>


<ul>
<li>Direct object inheritance: inherit properties/methods from another object.
</li>
<li>Implemented as ECMAScript 5's <code>Object.create()</code>.
</li>
<li>Useful when there's no need for overhead of creating separate constructors but need an object to behave similarly to another.
</li>
</ul>


</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Parasitic Inheritance</h3>
<div class="outline-text-3" id="text-4-5">





<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">createAnother</span>(<span style="color: #8ac6f2;">original</span>){
    <span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">another</span> = Object.create(original);
    another.doSomething = <span style="color: #8ac6f2;">function</span>(){ alert(<span style="color: #95e454; font-style: italic;">"does something"</span>);};

    <span style="color: #8ac6f2;">return</span> another;
}
</pre>


<ul>
<li>Use Prototype Inheritance to create similar objects from existin object.
</li>
<li>Add new methods/properties.
</li>
<li>No code reuse.
</li>
</ul>


</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Parasitic Combination Inheritance</h3>
<div class="outline-text-3" id="text-4-6">





<pre class="src src-javascript"><span style="color: #8ac6f2;">function</span> <span style="color: #ad7fa8; font-weight: bold; font-style: italic;">inheritPrototype</span>(<span style="color: #8ac6f2;">subtype</span>, <span style="color: #8ac6f2;">supertype</span>){
    <span style="color: #8ac6f2;">var</span> <span style="color: #8ac6f2;">proto</span> = Object.create(supertype.<span style="color: #e5786d;">prototype</span>);
    proto.constructor = subtype;
    subtype.<span style="color: #e5786d;">prototype</span> = proto;
}

inheritPrototype(SubType, SuperType); <span style="color: #99968b; font-style: italic;">// </span><span style="color: #99968b; font-style: italic;">replace SubType.prototype = new SuperType();</span>
</pre>


<ul>
<li>Considered the most optimal inheritance paradigm.
</li>
<li>Supertype's constructor called only once.
</li>
<li>No duplicate properties in instance and prototype.
</li>
<li>Prototype chain is kept intact.
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-06-18T17:52-0400</p>
<p class="author">Author: Xiaohui Lu</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
